app/controllers/users_controller.rb

  def index
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "name", "email", "updated_at", "encrypted_password", "salt") VALUES ('f', '2011-05-23 06:16:10.875976', 'Artem Ezhov', 'grom20000noname@mail.ru', '2011-05-23 06:16:10.875976', 'fd0936d11234ab93022ffbc0eb7755717badd9689af554396fc88812fbb20e48', 'c415daa1dc742c945f370701f7fd77b0e9d0cfe8abf21455b32a67b595e1ee41')

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2011-05-31 05:44:40.713867', "email" = 'grom20000@gmail.com', "name" = 'Артем Ежов', "encrypted_password" = 'a369cb32f780f8f6a9d3a8c34f70cbbbfe7ed16eace707d9cbc9b42833aee4d4' WHERE "users"."id" = 1